src/DataProcessors/ПомощникСозданияИмущества/ПомощникСозданияИмущества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПомощникСозданияИмущества</name>
</mdclass:DataProcessor>

src/Documents/ВводИзменениеОстатка/ВводИзменениеОстатка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводИзменениеОстатка</name>
  <registerRecords>AccountingRegister.ЖурналОпераций</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеОборотыБюджета</registerRecords>
  <attributes>
    <name>ВалютаОперации</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектУчета</name>
    <type>
      <types>Characteristic.ВидыСубконто</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОперации</name>
    <comment>(Инф.)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделУчета</name>
    <type>
      <types>ChartOfAccountsRef.РазделыУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеНовогоОстатка</name>
    <comment>(Инф.)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеНовогоОстаткаПроцентов</name>
    <comment>(Инф.)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДохода</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНовогоОстатка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНовогоОстаткаПроцентов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРасхода</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФинансоваяЦель</name>
    <type>
      <types>CatalogRef.ФинансовыеЦели</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоШаблон</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

src/DataProcessors/ПомощникСозданияИмущества/Forms/Форма/Module.bsl
////////////////////////////////////////////////////////////////////////////////
//Обработка.ПомощникСозданияИмущества.Форма.Форма
//  
//  
//Параметры формы:
//  Стандартные параметры формы
//  
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	#Область ПрикрепленныеФайлы
	ПрикрепленныеФайлыСервер.ОбработатьИЗаписатьДанныеМультимедиа(МедиаФайлы, ТекущийОбъект.Ссылка);
	#КонецОбласти 
	
	Если НачальнаяСтоимость <> 0  Тогда
		ДокументОбъект = Документы.ВводИзменениеОстатка.СоздатьДокумент();
		ДатаОстатка = ?(ЗначениеЗаполнено(ДатаОстатка), ДатаОстатка, НачалоМесяца(ТекущаяДатаСеанса()));
		ДокументОбъект.Дата                 = ДатаОстатка;
		ДокументОбъект.РазделУчета          = ПланыСчетов.РазделыУчета.Имущество;
		ДокументОбъект.ОбъектУчета          = ТекущийОбъект.Ссылка;
		ДокументОбъект.ВалютаОперации       = ТекущийОбъект.Валюта;
		ДокументОбъект.СуммаНовогоОстатка   = НачальнаяСтоимость;
		ДокументОбъект.Комментарий          = "Ввод начального остатка";
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Записан элемент справочника", Новый Структура("ИмяСправочника,Ссылка, ВладелецФормы", 
			"Имущество", СправочникОбъект.Ссылка, ?(ТипЗнч(ВладелецФормы) = Тип("ФормаКлиентскогоПриложения"), ВладелецФормы.УникальныйИдентификатор, Неопределено)));
	Если НачальнаяСтоимость <> 0  Тогда
		Оповестить("Записана операция", Новый Структура("Дата, ВидДокумента, Ссылка, ЭтоШаблон, ВладелецФормы", 
				ДатаОстатка, "ВводИзменениеОстатка", Неопределено, ложь, Неопределено));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Записан элемент справочника" И ТипЗнч(Параметр) = Тип("Структура") Тогда
		
		ИмяСправочника = Неопределено;
		ФормаВладельца = Неопределено;
		Если Параметр.Свойство("ИмяСправочника", ИмяСправочника) И ИмяСправочника = "Имущество"
			И Параметр.Свойство("ВладелецФормы", ФормаВладельца) И ФормаВладельца = ЭтаФорма.УникальныйИдентификатор Тогда
			СправочникОбъект.Родитель = Параметр.Ссылка;
			ТекущийЭлемент  = Элементы.ОбъектИмуществаРодитель;
		КонецЕсли; 
	КонецЕсли;
		
	#Область ПрикрепленныеФайлы
	Если (ПрикрепленныеФайлыКлиент.ЭтоПрикреплениеФайла(ЭтотОбъект, ИмяСобытия, Источник))Тогда
		ПрикрепленныеФайлыКлиент.ОбработатьОповещениеДобавленияФайла(ЭтотОбъект, Параметр);
	ИначеЕсли (ПрикрепленныеФайлыКлиент.ЭтоИзменениеСпискаМультимедиа(ЭтотОбъект, ИмяСобытия, Источник))Тогда
		ПрикрепленныеФайлыКлиентСервер.ОбновитьПредставлениеТекущегоФайла(ЭтотОбъект);
	КонецЕсли;
	#КонецОбласти
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "СправочникОбъект.Комментарий", Заголовок);
	
КонецПроцедуры

&НаКлиенте
Процедура РодительОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ОбслуживаниеСправочниковКлиент.РасширенноеПолучениеДанныхОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

#Область ПрикрепленныеФайлы

&НаКлиенте
Процедура ПредставлениеТекущегоФайлаНажатие(Элемент, СтандартнаяОбработка)
	ПрикрепленныеФайлыКлиент.ОбработчикНажатияНаТекущийФайл(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ФайлКнопкаНавигацииНажатие(Элемент)
	ПрикрепленныеФайлыКлиент.ФайлКнопкаНавигацииНажатие(ЭтотОбъект, Элемент);
КонецПроцедуры


#КонецОбласти 



#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	#Область ПрикрепленныеФайлы
	ПрикрепленныеФайлыКлиентСервер.ОбновитьПредставлениеТекущегоФайла(ЭтотОбъект);
	#КонецОбласти	
	
	// Подготовка реквизитов формы
	
	// Подготовка редактируемых объектов
	Если Параметры.Копирование И ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		СправочникОбъект.Наименование = "Копия: " + Параметры.ЗначениеКопирования.Наименование;
		СправочникОбъект.Валюта = Параметры.ЗначениеКопирования.Валюта;
	Иначе
		СправочникОбъект.Наименование = ?(ЗначениеЗаполнено(СправочникОбъект.Наименование), СправочникОбъект.Наименование, "Новое имущество");
		СправочникОбъект.Валюта = Константы.ВалютаУчета.Получить();
	КонецЕсли; 
	СправочникОбъект.Активность = Истина;
	ДатаОстатка = КонецМесяца(ДобавитьМесяц(ТекущаяДатаСеанса(), -1));

	// Общие настройки форм элементов справочников
	РаботаСФормамиСправочников.ФормаЭлементаПриСозданииНаСервере(ЭтаФорма);
	
КонецПроцедуры


#КонецОбласти
